#Область ОписаниеОбработки
// 
// Вид обработки: Проверка знаний кандидата
// Версия обработки: 1.1.1.1
// Дата создания: 07.03.2026
// Создал: Кулебакин Н.А.
// Описание: Обработка предназначена для проверки знаний кандидата по заданным параметрам
//		и выдачи результата в виде таблицы "Нужные ведомости".
//		Параметры для проверки: Дата проверки, Оператор сравнения, Характеристика даты договора, Ведомость.
//		Реализованы алгоритмы проверки по дополнительным (динамическим) условиям:
//		1. Условия исключения лишнего реализованы в коде автоматически
//		2. Кандидатам мужчинам реализовать условное оформление через программный код (окрас строки
//			 в светло-зеленый цвет), для женщин через конфигуратор - не реализован, 
//			 т.к. он мешает реализации через программный код. 
//		3. Вывода информационного сообщения об удаленных ведомостях реализовано из критерия, что 
//			количество символов в фамилии кандидата 8-9 шт.- через произвольную форму. 
//			Дополнительно закомментированы строки рабочего кода для способа вывода через метод Сообщить(), 
//			определенный для разработчиков с фамилией менее 6 символов.
//	
#КонецОбласти

#Область ОписанияВпечатленийОтТеста
// 
// По сожности для начинающего разработчика - 10 из 10.
// Мозг напрягался запредельно, но если честно - это было очень круто!!!
// В начале я понял, что ничего не знаю и ничего не понимаю (хотя 6 месяцов проходил курсы и читал книги).
// При этом быстро в течении часа создал окружение для разработки и тестирования будущей обработки.
// Далее сильно спотыкался на моментах: отбор "нужных" ведомостей, удаление ненужных, 
// окрашивание строк, вывод сообщения через произвольную форму. Каждый такой момент вызывал отчаяние.
// Но когда я решал сложный момент я кайфовал (почти всегда засиживался до утра и семья могла слышать
// восторженные возгласы когда у меня получалось), таких эмоций я давно не испытывал 
// (наверно только на рыбалке когда ловил трофеи).
// 
// Мне в апреле 2026 будет 50 лет (в душе не более 30 :) - кто в теме, тот поймет). 
// С 1998 года я в ИТ. С 2008 года на руководящих должностях. 
// В октябре 2025 я ушел с работы. Произошло выгорание. Больше не хочу руководить, хочу реализовать
// свою мечту юности - быть программистом (разработчиком в 1С). Далее вижу себя разработчиком на купных проектах и 
// в будущем архитектором с уклоном по нагруженным системам).
// Были конечно сомнения, что я не справлюсь, но ваш тест помог мне понять, что мне это очень нравится.
// Благодарю! Это очень круто!!! Очень хочу работать в вашей команде.
// Как человек натренированный жизнью в реализациях проектов, я изискивал ВСЕ возможности для решения этой тестовой задачи.
// Думаю Вы легко поймете какие это были возможности :). К помощи бывших коллег не прибегал, использовал только Интернет.

//p.s. Эту область можно удалить. По стандартам она не обязательна :).
//     
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Объект.ДатаОтправки = ТекущаяДата();

	ТаблицаНужныеВедомости = Объект.ТаблицаНужныеВедомости;
	ТаблицаНужныеВедомости.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ДатаПроверкиПриИзменении(Элемент)

	ТаблицаНужныеВедомости = Объект.ТаблицаНужныеВедомости;
	ТаблицаНужныеВедомости.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область КлиентскиеПроцедурыИФункции

&НаКлиенте
// Заполняет таблицу "Нужные ведомости" данными из таблицы "Все ведомости" по заданным параметрам
Процедура ЗаполнитьНужное(Команда)
// Проверяет на заполненность необходимых параметров
	Ошибки = "";

	Если Не ЗначениеЗаполнено(Объект.ОператорСравнения) Тогда
		Ошибки = Ошибки + "• Не выбрано условие сравнения (Равно/Не равно)" + Символы.ПС;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ХарактеристикаДатыСравнения) Тогда
		Ошибки = Ошибки + "• Не выбран параметр даты сравнения (Min/Max)" + Символы.ПС;
	КонецЕсли;

	Если Не ПустаяСтрока(Ошибки) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбраны нужные параметры:" + Символы.ПС + Ошибки;
		Сообщение.Сообщить();
	Иначе
		ЗаполнитьНужноеНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Удаляет строки из таблицы "Нужные ведомости" по заданным параметрам
// и выводит информацию об удаленных строках
Процедура УдалитьЛишнее(Команда)
		
	УдаленныеНомера = УдалитьЛишнееНаСервере();
	ВывестиИнформациюОбУдаленииНаКлиенте(УдаленныеНомера);
	
КонецПроцедуры

&НаКлиенте
// Выводит информацию об удаленных строках
Процедура ВывестиИнформациюОбУдаленииНаКлиенте(УдаленныеНомера)

	УдаленныеНомера.СортироватьПоЗначению(НаправлениеСортировки.Возр);

	Количество = УдаленныеНомера.Количество();

	МассивНомеров = Новый Массив;
	Для Каждого ЭлементСписка Из УдаленныеНомера Цикл
		МассивНомеров.Добавить(ЭлементСписка.Значение);
	КонецЦикла;

	ТекстСообщения = "Удалено документов:" + Количество + " (" + СтрСоединить(МассивНомеров, ", ") + ")";

	// Алгоритм вывода информации для фамилии 8-9 символов (Кулебакин Н.А.),
	// через создание и открытие произвольной формы

	ПараметрыФормы = Новый Структура("Заголовок, Сообщение", "Информация об удалении", ТекстСообщения);

	// Всегда открываем новую форму с уникальным ключом
	ОткрытьФорму("Обработка.ПроверкаЗнанийКандидата.Форма.ИнформацияДляПользователя", ПараметрыФормы, , Истина);

	// Алгоритм вывода информации для фамилии менее 6 символов,
	// через вывод метод Сообщить()
	// Сообщение = Новый СообщениеПользователю;
	// Сообщение.Текст = ТекстСообщения;
	// Сообщение.Сообщить();

КонецПроцедуры

#КонецОбласти

#Область СерверныеПроцедурыИФункции

&НаСервере
// Заполняет таблицу ведомостей
Процедура ЗаполнитьНужноеНаСервере()
	//
	// 1. Получаем данные из запроса
	// 2. Проверяем условия
	// 3. Заполняем таблицу ведомостей
	//
	
	ДатаОтправки 				= Объект.ДатаОтправки;
	ОператорСравнения 			= Объект.ОператорСравнения;
	ХарактеристикаДатыСравнения = Объект.ХарактеристикаДатыСравнения;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ведомость.Ссылка КАК Ведомость,
	|	Ведомость.Дата КАК Дата,
	|	Ведомость.Договоры.(
	|		НомерСтроки КАК НомерСтроки,
	|		Договор.Наименование КАК Наименование,
	|		Договор.Активен КАК ДоговорАктивен,
	|		Договор.НачалоДействия КАК ДоговорНачалоДействия
	|	) КАК Договоры
	|ИЗ
	|	Документ.Ведомость КАК Ведомость
	|ГДЕ
	|	НЕ Ведомость.ПометкаУдаления";

	РезультатЗапроса 	= Запрос.Выполнить();
	ВыборкаДокументов 	= РезультатЗапроса.Выбрать();
	ТаблицаНужныеВедомости = Объект.ТаблицаНужныеВедомости;
	ТаблицаНужныеВедомости.Очистить();
	
	// Проверка условий по датам и вывод в таблицу ведомостей
	Пока ВыборкаДокументов.Следующий() Цикл
		ПроверитьДокументы = ПроверитьДоговорыВДокументе(ВыборкаДокументов, ОператорСравнения,
			ХарактеристикаДатыСравнения, ДатаОтправки);

		Если ПроверитьДокументы Тогда
			НоваяСтрока 			= ТаблицаНужныеВедомости.Добавить();
			НоваяСтрока.Ведомость	= ВыборкаДокументов.Ведомость;
			НоваяСтрока.Дата 		= ВыборкаДокументов.Дата;
		КонецЕсли;

	КонецЦикла;
	
	// Сортировка таблицы ведомостей по дате
	ТаблицаНужныеВедомости.Сортировать("Дата Возр");
	
	// Установка цвета строк таблицы ведомостей
	УстановитьЦветСтрокТаблицы(ТаблицаНужныеВедомости);

КонецПроцедуры

&НаСервереБезКонтекста
// Функция проверяет наличие активных договоров в документе и проверяет условие по датам
Функция ПроверитьДоговорыВДокументе(ВыборкаДокументов, ОператорСравнения, ХарактеристикаДатыСравнения, ДатаОтправки)
	
	// Определяем параметры активных договоров в документе
	ПервыйАктивныйДоговор 	= Неопределено;
	МинимальнаяДата 		= Неопределено;
	МаксимальнаяДата 		= Неопределено;
	ДатаВедомости 			= ВыборкаДокументов.Ведомость.Дата;
	
	ВыборкаДоговоров = ВыборкаДокументов.Договоры.Выбрать();
	Пока ВыборкаДоговоров.Следующий() Цикл
		Если ВыборкаДоговоров.ДоговорАктивен И ПервыйАктивныйДоговор = Неопределено Тогда
			ПервыйАктивныйДоговор = ВыборкаДоговоров.ДоговорНачалоДействия;
		КонецЕсли;
		
		Если МинимальнаяДата = Неопределено Или ВыборкаДоговоров.ДоговорНачалоДействия < МинимальнаяДата Тогда
			МинимальнаяДата = ВыборкаДоговоров.ДоговорНачалоДействия;
		КонецЕсли;
		
		Если МаксимальнаяДата = Неопределено Или ВыборкаДоговоров.ДоговорНачалоДействия > МаксимальнаяДата Тогда
			МаксимальнаяДата = ВыборкаДоговоров.ДоговорНачалоДействия;
		КонецЕсли;
	КонецЦикла;
	
	// Проверяем условие по датам
	ПроверкаДатыДоговора 	= ПроверитьУсловиеДаты(ПервыйАктивныйДоговор, МинимальнаяДата, МаксимальнаяДата,
											ОператорСравнения, ХарактеристикаДатыСравнения);
	// Проверяем дополнительное условие по датам отправки
	ПроверкаДоп 			= ПроверитьПоДопУсловиям(ДатаОтправки, ДатаВедомости);
	Если ПроверкаДатыДоговора И ПроверкаДоп Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Проверяем условие по датам договора
Функция ПроверитьУсловиеДаты(ПервыйАктивныйДоговор, МинимальнаяДата, МаксимальнаяДата, ОператорСравнения,
	ХарактеристикаДатыСравнения)

	Если ПервыйАктивныйДоговор = Неопределено Или МинимальнаяДата = Неопределено Или МаксимальнаяДата = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ХарактеристикаДатыСравнения = "Min" Тогда
		НужнаяДата = МинимальнаяДата;
	Иначе
		НужнаяДата = МаксимальнаяДата;
	КонецЕсли;

	Если ОператорСравнения = "Равно" Тогда
		Возврат (ПервыйАктивныйДоговор = НужнаяДата);
	Иначе
		Возврат (ПервыйАктивныйДоговор <> НужнаяДата);
	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
// Проверяем на доп условия. Если дата отправки решения:
//  1-10 число, тогда не выводим ведомости "Если число (день) даты ведомости равно числу текущей даты"
// 11-20 число, тогда не выводим ведомости "Если число (день) даты ведомости является чётным"
// 21-31 число, тогда не выводим ведомости "Если месяц даты ведомости является нечётным"
Функция ПроверитьПоДопУсловиям(ДатаОтправки, ДатаВедомости)
	
	ДеньОтправки 	= День(ДатаОтправки);
	ДеньВедомости 	= День(ДатаВедомости);
	ДеньТекущий 	= День(ТекущаяДата());
	МесяцВедомости 	= Месяц(ДатаВедомости);

	Если ДеньОтправки < 11 И ДеньВедомости = ДеньТекущий Тогда
		Возврат Ложь;
	ИначеЕсли ДеньОтправки > 20 И МесяцВедомости % 2 <> 0 Тогда
		Возврат Ложь;
	ИначеЕсли ДеньОтправки >= 11 И ДеньОтправки <= 20 И ДеньВедомости % 2 = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
// Получает и возвращает последние статусы документов для "Процедура УстановитьЦветСтрокТаблицы ()" 
Функция ПолучитьПоследниеСтатусыДокументов(СписокДокументов)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсторияСтатусовДокументов.Документ КАК Документ,
	|	ИсторияСтатусовДокументов.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.ИсторияСтатусовДокументов КАК ИсторияСтатусовДокументов
	|ГДЕ
	|	ИсторияСтатусовДокументов.Документ В (&СписокДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсторияСтатусовДокументов.Документ,
	|	ИсторияСтатусовДокументов.ДатаЗаписи УБЫВ";

	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	СписокСтатусов = Новый Соответствие;
	ТекущийДокумент = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Документ <> ТекущийДокумент Тогда
			ТекущийДокумент = Выборка.Документ;
			СписокСтатусов.Вставить(ТекущийДокумент, Выборка.Статус);
		КонецЕсли;
	КонецЦикла;

	Возврат СписокСтатусов;

КонецФункции

&НаСервере
// Удаляет лишние ведомости из таблицы "ТаблицаНужныеВедомости
Функция УдалитьЛишнееНаСервере()
	// Собрать все ведомости в массив
	МассивВедомостей = Новый Массив;
	Для Каждого СтрокаТаблицы Из Объект.ТаблицаНужныеВедомости Цикл
		МассивВедомостей.Добавить(СтрокаТаблицы.Ведомость);
	КонецЦикла;
	
	// Получить все данные одним запросом
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ведомость.Ссылка КАК Ведомость,
	|	ВЫБОР
	|		КОГДА КоличествоДоговоров.Количество ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ КоличествоДоговоров.Количество
	|	КОНЕЦ КАК КоличествоДоговоров
	|ИЗ
	|	Документ.Ведомость КАК Ведомость
	|		ЛЕВОЕ СОЕДИНЕНИЕ (
	|			ВЫБРАТЬ
	|				ВедомостьДоговоры.Ссылка КАК Ссылка,
	|				КОЛИЧЕСТВО(ВедомостьДоговоры.Договор) КАК Количество
	|			ИЗ
	|				Документ.Ведомость.Договоры КАК ВедомостьДоговоры
	|			ГДЕ
	|				ВедомостьДоговоры.Ссылка В (&СписокВедомостей)
	|			СГРУППИРОВАТЬ ПО
	|				ВедомостьДоговоры.Ссылка
	|		) КАК КоличествоДоговоров
	|		ПО Ведомость.Ссылка = КоличествоДоговоров.Ссылка
	|ГДЕ
	|	Ведомость.Ссылка В (&СписокВедомостей)";

	Запрос.УстановитьПараметр("СписокВедомостей", МассивВедомостей);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	УдаленныеНомера = Новый СписокЗначений;
	НомераДляУдаления = Новый Соответствие;

	Пока Выборка.Следующий() Цикл
		// Проверка четности
		Если Выборка.КоличествоДоговоров % 2 = 0 Тогда
			НомерДокумента = Выборка.Ведомость.Номер;
			УдаленныеНомера.Добавить(НомерДокумента);
			НомераДляУдаления.Вставить(НомерДокумента, Истина);
		КонецЕсли;
	КонецЦикла;

	УдалитьСтрокиПоНомерам(НомераДляУдаления);

	Возврат УдаленныеНомера;

КонецФункции

&НаСервере
// Удаляет строки таблицы "ТаблицаНужныеВедомости" по номерам ведомостей
Процедура УдалитьСтрокиПоНомерам(НомераДляУдаления)
	
	ТаблицаНужныеВедомости = Объект.ТаблицаНужныеВедомости;
	
	Индекс = ТаблицаНужныеВедомости.Количество() - 1;
	Пока Индекс >= 0 Цикл
		СтрокаТаблицы = ТаблицаНужныеВедомости[Индекс];
		НомерДокумента = СтрокаТаблицы.Ведомость.Номер;
		Если НомераДляУдаления.Получить(НомерДокумента) <> Неопределено Тогда
			ТаблицаНужныеВедомости.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Устанавливает цвет строки таблицы "ТаблицаНужныеВедомости" в зависимости от статуса документа
Процедура УстановитьЦветСтрокТаблицы(ТаблицаВедомости)
	
	УсловноеОформление.Элементы.Очистить();
	
	// Проставим статус документа в реквизите формы
	МассивВедомостей = Новый Массив;
	Для Каждого СтрокаТаблицы Из Объект.ТаблицаНужныеВедомости Цикл
		МассивВедомостей.Добавить(СтрокаТаблицы.Ведомость);
	КонецЦикла;
		
	СписокСтатусов = ПолучитьПоследниеСтатусыДокументов(МассивВедомостей);
	
	Для Каждого СтрокаТаблицы Из Объект.ТаблицаНужныеВедомости Цикл
		ПоследнийСтатус = СписокСтатусов.Получить(СтрокаТаблицы.Ведомость);
		СтрокаТаблицы.АктуальныйСтатус = ПоследнийСтатус;
	КонецЦикла;	
	
	// Установим цвет строки в зависимости от статуса документа
	НовыйЭлемент = УсловноеОформление.Элементы.Добавить();
	НовыйЭлемент.Использование = Истина;
	
	ЭлементОтбора = НовыйЭлемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТаблицаНужныеВедомости.АктуальныйСтатус");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.СтатусыДокументов.Акцептован;
	
	НовыйЭлемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗеленый);
	
	// Укажем оформляемые поля БЕЗ префикса Объект.
	Поле = НовыйЭлемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаНужныеВедомостиВедомость");
	Поле.Использование = Истина;
	
КонецПроцедуры

#КонецОбласти