&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)//создаем элементы формы для отображения информации
//Создаем элементы формы для отображения информации пользователю на основе переданных параметров.
	
	МассивРеквизитов = Новый Массив;
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	
	РеквизитТекстЗаголовка = Новый РеквизитФормы("ТекстЗаголовка", ОписаниеТиповСтрока, , "ТекстЗаголовка");
	МассивРеквизитов.Добавить(РеквизитТекстЗаголовка);
	
	РеквизитСообщение = Новый РеквизитФормы("Сообщение", ОписаниеТиповСтрока, , "Сообщение");
	МассивРеквизитов.Добавить(РеквизитСообщение);
	
	ИзменитьРеквизиты(МассивРеквизитов);
	
//Устанавливаем заголовок формы.
	Заголовок = "Информация для пользователя";
	АвтоЗаголовок = Ложь;
	
//Добавляем элементы формы.
	ДекорацияЗаголовка 							= Элементы.Добавить("ДекорацияЗаголовка", Тип("ДекорацияФормы"));
	ДекорацияЗаголовка.Заголовок 				= ЭтотОбъект.ТекстЗаголовка;
	ДекорацияЗаголовка.РастягиватьПоГоризонтали = Истина;
	
	ДекорацияСообщения 							= Элементы.Добавить("ДекорацияСообщения", Тип("ДекорацияФормы"));
	ДекорацияСообщения.Заголовок 				= ЭтотОбъект.Сообщение;
	ДекорацияСообщения.РастягиватьПоГоризонтали = Истина;
	ДекорацияСообщения.РастягиватьПоВертикали 	= Истина;
	ДекорацияСообщения.Высота 					= 10;
	
КонецПроцедуры

